---
kind: type
id: T:Autodesk.Revit.DB.Visual.BumpMap
source: html/7301801c-eef2-3077-7891-a3ee27db1a9b.htm
---
# Autodesk.Revit.DB.Visual.BumpMap

A static class that provides access to the property names that appear in the BumpMap visual asset schema.

## Syntax (C#)
```csharp
public static class BumpMap
```